# vim: ft=zsh

#lukechilds/zsh-nvm
#
#robbyrussell/oh-my-zsh path:plugins/colored-man-pages
#robbyrussell/oh-my-zsh path:plugins/command-not-found
#robbyrussell/oh-my-zsh path:plugins/git
#robbyrussell/oh-my-zsh path:plugins/git-extras
#robbyrussell/oh-my-zsh path:plugins/gitignore
#robbyrussell/oh-my-zsh path:plugins/github

# jeffreytse/zsh-vi-mode: Adds vi keybindings to Zsh.
# Example usage: Use vi-style navigation and editing commands in your Zsh command line.
jeffreytse/zsh-vi-mode

# zsh-fzf-history-search: Integrates the fuzzy finder fzf with Zsh.
# Example usage: Use `Ctrl+R` to search through your command history with fzf.
joshskidmore/zsh-fzf-history-search

# MichaelAquilina/zsh-auto-notify: Notifies you when a long-running command finishes.
# Example usage: Receive a desktop notification when a command like `sleep 10` finishes.
MichaelAquilina/zsh-auto-notify

#romkatv/powerlevel10k: A fancy prompt
romkatv/powerlevel10k

# rupa/z: Allows you to quickly navigate to directories you have visited frequently.
# Example usage: Use `z <directory>` to jump to a directory you have visited before.
#rupa/z

# zsh-users/zsh-autosuggestions: Suggests commands as you type based on your command history.
# Example usage: Start typing a command and see suggestions appear in light gray.
zsh-users/zsh-autosuggestions

# zsh-users/zsh-completions: Adds many more tab completions to Zsh.
# Example usage: Type a command and press Tab to see a list of possible completions.
zsh-users/zsh-completions

# zsh-users/zsh-history-substring-search: Allows you to search your command history by typing a substring of the command.
# Example usage: Press the up arrow key to search through your history for commands containing the typed substring.
zsh-users/zsh-history-substring-search

# zsh-users/zsh-syntax-highlighting: Provides syntax highlighting for the Zsh command line.
# Example usage: Type a command and see it highlighted in different colors based on syntax.
zsh-users/zsh-syntax-highlighting
